app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "hello ari"], ["body", "hello billo"], ["user_id", 2], ["created_at", "2021-03-17 13:07:56.981588"], ["updated_at", "2021-03-17 13:07:56.981588"]]